Revit 2026 API

# WaveWaveWaveLenMax Property

---

The property labeled "Len Max" from the "Wave" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaveWaveLenMax { get; }
```
```vb
Public Shared ReadOnly Property WaveWaveLenMax As String
	Get
```
```cpp
public:
static property String^ WaveWaveLenMax {
	String^ get ();
}
```
```fsharp
static member WaveWaveLenMax : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".

#### Reference

Wave Class

Autodesk.Revit.DB.Visual Namespace